       identification division.
       PROGRAM-ID. A.
       AUTHOR. JEFERSON.
       INSTALLATION. FATEC.
       DATE-WRITTEN. 27/02/2023.
       DATE-COMPILED.
       SECURITY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBMPC.
       OBJECT-COMPUTER. IBMPC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       77 BASE PIC 99999.
       77 ALTURA PIC 999V99.
       77 AREAA PIC 9999V99.

       SCREEN SECTION.

       01  TELA.
           02 BLANK SCREEN.
           02 LINE 3 COL 10 VALUE "CALCULAR AREA DO TRIANGULO".

       01  TELA-PRINCIPAL.
           02 LINE 5 COL 10 VALUE 'DIGITE A BASE:'.
           02 LINE 6 COL 10 VALUE 'DIGITE A ALTURA:'.
           02 LINE 8 COL 10 VALUE 'A AREA DESTE TRIANGULO E:'.

       01  TELA-BASE.
           02 LINE 5 COL 25 PIC 999,99 TO BASE.
       01  TELA-ALTURA.
           02 LINE 6 COL 27 PIC 999,99 TO ALTURA.

       01  TELA-RESULT.
           02 LINE 8 COL 35 PIC 9999,99 FROM AREAA REVERSE-VIDEO.

       PROCEDURE DIVISION.

           DISPLAY ERASE.
           DISPLAY TELA.
           DISPLAY TELA-PRINCIPAL.

           PERFORM PRINCIPAL.


           PRINCIPAL.
              ACCEPT TELA-BASE.
              ACCEPT TELA-ALTURA.

              COMPUTE AREAA = (base * altura)/2.

              DISPLAY TELA-RESULT.
