       IDENTIFICATION DIVISION.
       PROGRAM-ID. C.
       AUTHOR. JEFERSON.
       INSTALLATION.
       DATE-WRITTEN. 27/02/2023.
       DATE-COMPILED.
       SECURITY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBMPC.
       OBJECT-COMPUTER. IBMPC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77  ANO PIC 999.
       77  MES   PIC 99.
       77  DIA   PIC 99.
       77  RESULT PIC 999999.

       SCREEN SECTION.

       01 TELA.
           02 LINE 3 COL 20 VALUE "Converter idade para dias".
       01 TELA-PRINCIPAL.
           02 LINE 5 COL 20 VALUE 'QUANTOS ANOS VOCE TEM:'.
           02 LINE 6 COL 20 VALUE 'QUANTIDADE DE MESES:'.
           02 LINE 7 COL 20 VALUE 'QUANTIDADE DE DIAS:'.
           02 LINE 9 COL 20 VALUE 'QUANTOS DIAS DE VIDA VOCE JA TEVE:'.

       01 TELA-ANO.
           02 LINE 5 COL 45 PIC 999 TO ANO.
       01 TELA-MES.
           02 LINE 6 COL 41 PIC 99 TO MES.
       01 TELA-DIA.
           02 LINE 7 COL 40 PIC 99 TO DIA.
       01 TELA-RESULT.
           02 LINE 9 COL 55 PIC 999999 FROM RESULT REVERSE-VIDEO.

       PROCEDURE DIVISION.
           DISPLAY ERASE.
           DISPLAY TELA.
           DISPLAY TELA-PRINCIPAL.
           PERFORM PRINCIPAL.

           PRINCIPAL.

             ACCEPT TELA-ANO.
             ACCEPT TELA-MES.
             ACCEPT TELA-DIA.

             COMPUTE RESULT = (ANO*365)+(MES*30)+DIA.

             DISPLAY TELA-RESULT.


