       IDENTIFICATION DIVISION.
       PROGRAM-ID. D.
       AUTHOR. JEFERSON.
       INSTALLATION.
       DATE-WRITTEN. 27/02/2023.
       DATE-COMPILED.
       SECURITY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBMPC.
       OBJECT-COMPUTER. IBMPC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77  valorfbrt PIC 9999999V99.
       77  DISTRIBUIDORA PIC 9V99 VALUE 0,28.
       77  IMPOSTO       PIC 9V99 VALUE 0,45.
       77  VALORFINAL PIC 9999999V99.

       SCREEN SECTION.

       01  TELA.
           02 BLANK SCREEN.
           02 LINE 3 COL 10 VALUE
           "Calcular preco final para o consumidor".
       01  TELA-PRINCIPAL.
           02 LINE 5 COL 10 VALUE 'QUAL O VALOR DE FABRICA:'.
           02 LINE 6 COL 10 VALUE 'O VALOR PARA O CONSUMIDOR FINAL E:'.

       01  TELA-VALORFBRT.
           02 LINE 5 COL 35 PIC 9999999,99 TO VALORFBRT.

       01  TELA-RESULT.
           02 LINE 6 COL 45 PIC 9999999,99 FROM VALORFINAL
           REVERSE-VIDEO.

       PROCEDURE DIVISION.
           DISPLAY ERASE.
           DISPLAY TELA.
           DISPLAY TELA-PRINCIPAL.

           PERFORM PRINCIPAL.

           PRINCIPAL.
             ACCEPT TELA-VALORFBRT.

             COMPUTE VALORFINAL = (VALORFBRT*IMPOSTO)+
             (VALORFBRT*DISTRIBUIDORA)+VALORFBRT.

             DISPLAY TELA-RESULT.
