       IDENTIFICATION DIVISION.
       PROGRAM-ID. E.
       AUTHOR. JEFERSON.
       INSTALLATION. FATEC.
       DATE-WRITTEN. 27/02/2023.
       DATE-COMPILED.
       SECURITY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBMPC.
       OBJECT-COMPUTER. IBMPC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 SALFIX PIC     99999V99.
       77 VALPORVEN PIC  99999V99.
       77 VALCCOM PIC 9V99 VALUE 0,05.
       77 QTDDVEND PIC 9999.
       77 VALTOTAL PIC 999999999V99.
       77 RESULT   PIC 999999999V99.
       SCREEN SECTION.

       01 TELA.
          02 BLANK SCREEN.
          02 LINE 3 COL 10 VALUE "CALCULAR SALARIO FINAL".

       01 TELA-PRINCIPAL.
          02 LINE 5 COL 10 VALUE 'SALARIO FIXO:'.
          02 LINE 6 COL 10 VALUE 'VALOR POR CARRO VENDIDO:'.
          02 LINE 7 COL 10 VALUE 'QUANTIDADE DE CARROS VENDIDOS:'.
          02 LINE 8 COL 10 VALUE 'VALOR TOTAL DA VENDAS:'.
          02 LINE 10 COL 10 VALUE 'VALOR FINAL DO SALARIO:'.

       01 TELA-SALFIX.
           02 LINE 5 COL 24 PIC 99999,99 TO SALFIX.
       01 TELA-VALPORVEN.
           02 LINE 6 COL 35 PIC 99999,99 TO VALPORVEN.
       01 TELA-QTDDVEND.
           02 LINE 7 COL 41 PIC 9999 TO QTDDVEND.
       01 TELA-VALTOTAL.
           02 LINE 8 COL 33 PIC 999999999,99 TO VALTOTAL.
       01 TELA-RESULT.
           02 LINE 10 COL 34 PIC 999999999,99 FROM RESULT REVERSE-VIDEO.

       PROCEDURE DIVISION.

           DISPLAY ERASE.
           DISPLAY TELA.
           DISPLAY TELA-PRINCIPAL.

           PERFORM PRINCIPAL.


           PRINCIPAL.

           ACCEPT TELA-SALFIX.
           ACCEPT TELA-VALPORVEN.
           ACCEPT TELA-QTDDVEND.
           ACCEPT TELA-VALTOTAL.

           COMPUTE RESULT = SALFIX+(VALCCOM*VALTOTAL)+
           (QTDDVEND*VALPORVEN).

           DISPLAY TELA-RESULT.

