       IDENTIFICATION DIVISION.
       PROGRAM-ID. F.
       AUTHOR. JEFERSON.
       INSTALLATION.
       DATE-WRITTEN. 27/02/2023.
       DATE-COMPILED.
       SECURITY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBMPC.
       OBJECT-COMPUTER. IBMPC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 VALFIXO PIC 9V99 VALUE 5,00.
       77 VALPORKM PIC 9V99 VALUE 4,50.
       77 VALPERCO PIC 9999V99.
       77 RESULT PIC 999V99.

       SCREEN SECTION.
       01 TELA.
           02 BLANK SCREEN.
           02 LINE 3 COL 20 VALUE "CALCULAR VALOR DA VIAGEM".

       01 TELA-PRINCIPAL.
           02 LINE 5 COL 20 VALUE 'QUANTOS KM A SER RODADO:'.
           02 LINE 7 COL 20 VALUE 'O VALOR SERA DE:'.

       01 TELA-KM.
           02 LINE 5 COL 45 PIC 9999,99 TO VALPERCO.

       01 TELA-RESULT.
           02 LINE 7 COL 37 PIC 999,99 FROM RESULT REVERSE-VIDEO.

       PROCEDURE DIVISION.
           DISPLAY ERASE.
           DISPLAY TELA.
           DISPLAY TELA-PRINCIPAL.

           PERFORM PRINCIPAL.

           PRINCIPAL.
           ACCEPT TELA-KM.
           COMPUTE RESULT = VALFIXO+(VALPERCO*VALPORKM).
           DISPLAY TELA-RESULT.
